In [3]:
import pandas as pd

In [5]:
series = pd.Series(["BMW", "Toyota", "Honda"])
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [7]:
fruit = ["Apple", "Banana", "Orange"]
index = ["a", "b", "c"]
fruit_name = pd.Series(fruit, index=index)
fruit_name

a     Apple
b    Banana
c    Orange
dtype: object

In [9]:
# Series 1-dimensional data
name = pd.Series(["Rohan", "Jeevan", "Krishna"])
name

0      Rohan
1     Jeevan
2    Krishna
dtype: object

In [11]:
series = pd.Series(["Bmw", "Lamborgini", "RR"])
series

0           Bmw
1    Lamborgini
2            RR
dtype: object

In [13]:
color = pd.Series(["Blue", "Yellow", "Black"])
color

0      Blue
1    Yellow
2     Black
dtype: object

In [15]:
# 2-dimensional series
name = pd.DataFrame({"Car Make":series,"Color":color})
name

     Car Make   Color
0         Bmw    Blue
1  Lamborgini  Yellow
2          RR   Black

In [17]:
fruits = pd.Series(["Apple", "Orange", "Mango"])
fruits

0     Apple
1    Orange
2     Mango
dtype: object

In [19]:
color = pd.Series(["Red", "Yellow", "Green"])
color

0       Red
1    Yellow
2     Green
dtype: object

In [21]:
Fruits_name = pd.DataFrame({"Name":fruits,"Color":color})
Fruits_name

     Name   Color
0   Apple     Red
1  Orange  Yellow
2   Mango   Green

### Importing Data

In [24]:
car_sales = pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [30]:
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [32]:
car_sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [36]:
# Exporting dataframe
car_sales.to_csv("testoutput.csv", index = False)

# Describe Data

In [41]:
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [43]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [49]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [53]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [57]:
car_sales.shape

(10, 5)

In [63]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [67]:
car_prices = pd.Series([3000, 6000, 3200])
car_prices

0    3000
1    6000
2    3200
dtype: int64

In [99]:
print(f"Mean of car prices is: {car_prices.mean()}")
print(f"Sum of car prices is: {car_prices.sum()}")

Mean of car prices is: 4066.6666666666665
Sum of car prices is: 12200

In [103]:
car_sales["Doors"].sum()

40

In [105]:
car_sales["Odometer (KM)"].sum()

786014

In [107]:
len(car_sales)

10

In [111]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

# Loc and iloc

In [122]:
animal = pd.Series(["Dog", "Elephant", "Cat", "Tiger", "Lion"], index=[3,6,7,9,12])
animal

3          Dog
6     Elephant
7          Cat
9        Tiger
12        Lion
dtype: object

In [128]:

animal.loc[6]

'Elephant'

In [130]:
animal.loc[9]

'Tiger'

In [132]:
animal.loc[3]

'Dog'

In [134]:
animal.iloc[3]

'Tiger'

In [136]:
animal.iloc[4]

'Lion'

### loc gives the element in that index, whereas iloc returns the elements in that position.

In [141]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [145]:
car_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [147]:
car_sales.loc[5]

Make                Toyota
Colour               Green
Odometer (KM)        99213
Doors                    4
Price            $4,500.00
Name: 5, dtype: object

In [149]:
car_sales.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [153]:
animal

3          Dog
6     Elephant
7          Cat
9        Tiger
12        Lion
dtype: object

In [155]:
animal[:3]

3         Dog
6    Elephant
7         Cat
dtype: object

In [157]:
animal[:4]

3         Dog
6    Elephant
7         Cat
9       Tiger
dtype: object

In [159]:
car_sales[:4]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

In [161]:
car_sales[3:]

     Make Colour  Odometer (KM)  Doors       Price
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [163]:
car_sales[3:7]

     Make Colour  Odometer (KM)  Doors       Price
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [165]:
car_sales.Make

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [167]:
car_sales["Make"]

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [171]:
car_sales.Colour

0    White
1      Red
2     Blue
3    Black
4    White
5    Green
6     Blue
7     Blue
8    White
9    White
Name: Colour, dtype: object

In [183]:
new = pd.DataFrame({"Odometer (KM)":car_sales["Odometer (KM)"]})
new

   Odometer (KM)
0         150043
1          87899
2          32549
3          11179
4         213095
5          99213
6          45698
7          54738
8          60000
9          31600

In [195]:
car_sales[car_sales["Make"] == "Toyota"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [199]:
car_sales[car_sales["Doors"] <=4]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00
4  Nissan  White         213095      4  $3,500.00
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [201]:
car_sales[car_sales["Make"] == "Honda"]

    Make Colour  Odometer (KM)  Doors      Price
1  Honda    Red          87899      4  $5,000.00
6  Honda   Blue          45698      4  $7,500.00
7  Honda   Blue          54738      4  $7,000.00

In [203]:
car_sales[car_sales["Colour"] == "White"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [ ]:
car_sales[car_sales["Odometer (KM)" > 1